src/Catalogs/рнсРазделыОбщихНастроек/рнсРазделыОбщихНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсРазделыОбщихНастроек</name>
  <predefined>
    <items>
      <name>ЗаполнениеЗаявкиДС</name>
      <description>Заполнение заявки ДС</description>
    </items>
    <items>
      <name>ЗначенияПоУмолчанию</name>
      <description>Значения по умолчанию</description>
    </items>
    <items>
      <name>ОповещниеОбИзмненеиях</name>
      <description>Оповещние об измненеиях</description>
    </items>
  </predefined>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.рнсГруппыДоступаРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСекцииРаздела</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлюча</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКлючНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения2</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения3</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения4</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения5</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФормыЗаполненияХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Секции</name>
    <attributes>
      <name>Секция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязиПараметровВыбора</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДанным</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзменениеЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаКлюча</name>
    <attributes>
      <name>ПолеКлюча</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/рнсРазделыОбщихНастроек/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
                 
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ИспользоватьЗаполнениеХранилища = ЗначениеЗаполнено(Объект.ИмяФормыЗаполненияХранилища);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьТекстОписанияКлюча(); 
	ОбновитьНастройкуСекцийРаздела();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФормаЗаполненияХранилищаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОтборРодителей = Новый Массив;
	ОтборРодителей.Добавить("ОбщиеФормы");	 
	ОтборРодителей.Добавить("Справочник.рнсРазделыОбщихНастроек"); 	
	ОтборРодителей.Добавить("РегистрСведений.рнсОбщиеНастройки");
	
	Оповещение 	= Новый ОписаниеОповещения("ВыборФормы_Завершение", ЭтотОбъект);  		 	
	Ограничения = Новый Структура("ПоКоллекцииМетаданных", ОтборРодителей);	  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипДанныхВыбора", 3);	
	ПараметрыФормы.Вставить("Ограничения", Ограничения);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);  
	
	Если ЗначениеЗаполнено(Объект.ИмяФормыЗаполненияХранилища) Тогда
		ПараметрыФормы.Вставить("Отмеченные", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.ИмяФормыЗаполненияХранилища));	
	КонецЕсли;  
	
	ОткрытьФорму("ОбщаяФорма.рнсФормаВыбораОбъектовМетаданных", ПараметрыФормы, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры  
																						
&НаКлиенте
Процедура ФормаЗаполненияХранилищаПриИзменении(Элемент)
	
	ИспользоватьЗаполнениеХранилища = ЗначениеЗаполнено(Объект.ИмяФормыЗаполненияХранилища);
	
КонецПроцедуры    																					

&НаКлиенте
Процедура ИспользоватьКлючНастройкиПриИзменении(Элемент)  		
	
	ОбновитьТекстОписанияКлюча();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстОпаисаниеПолейКлючаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	Если Объект.ИспользоватьКлючНастройки Тогда    	
	
		Оповещение = Новый ОписаниеОповещения("НастройкиПолейКлюча_Завершение", ЭтотОбъект);
		НастройкаКлюча = Новый Массив;
		
		Для каждого Ит Из Объект.НастройкаКлюча Цикл
			
			ОписаниеПоляКлюча = Новый Структура;
			ОписаниеПоляКлюча.Вставить("ПолеКлюча", Ит.ПолеКлюча); 
			ОписаниеПоляКлюча.Вставить("Заголовок", Ит.Заголовок);
			
			НастройкаКлюча.Добавить(ОписаниеПоляКлюча);
			
		КонецЦикла;   
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НастройкаКлюча", НастройкаКлюча);
		
		ОткрытьФорму("Справочник.рнсРазделыОбщихНастроек.Форма.ФормаНастройкиПолейКлюча", 
									ПараметрыФормы, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.Независимый);  
									
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ИспользоватьСекцииРазделаПриИзменении(Элемент)
	
	ОбновитьНастройкуСекцийРаздела();	
	
КонецПроцедуры    

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастройкиПолейКлюча_Завершение(Результат, ДополнительныеПараметры) Экспорт   
	                                    	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		
		Объект.НастройкаКлюча.Очистить(); 		
		
		Для каждого Ит Из Результат Цикл   		
			ЗаполнитьЗначенияСвойств(Объект.НастройкаКлюча.Добавить(), Ит);	 		
		КонецЦикла;  
		
		ОбновитьТекстОписанияКлюча();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекстОписанияКлюча()
	
	Если Объект.ИспользоватьКлючНастройки Тогда  
		
		КоличествоПолейКлюча = Объект.НастройкаКлюча.Количество(); 	
		
		Если КоличествоПолейКлюча = 0 Тогда    
			ТекстОписанияПолейКлюча	= НСтр("ru = 'Дополнительные поля ключа не используются'");	
		Иначе         
			
			МасивТиповПолей 		= Новый Массив;
			ТекстШаблонаОписания 	= НСтр("ru = 'Поля ключа: %1'");
			
			Для каждого Ит Из Объект.НастройкаКлюча Цикл 				 
				МасивТиповПолей.Добавить(Ит.Заголовок);		
			КонецЦикла;
			
			ТекстОписанияПолейКлюча	= СтрШаблон(ТекстШаблонаОписания, СтрСоединить(МасивТиповПолей, ","));	
			
		КонецЕсли; 	
		
	Иначе   	
		ТекстОписанияПолейКлюча = НСтр("ru = 'Ключи не используются'");
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьНастройкуСекцийРаздела()
	
	Элементы.СтраницаСекции.Видимость = Объект.ИспользоватьСекцииРаздела;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыборФормы_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.ИмяФормыЗаполненияХранилища = Результат[0];
	Иначе    
		Если Результат <> Неопределено Тогда
			Объект.ИмяФормыЗаполненияХранилища = "";	
		КонецЕсли;  		
	КонецЕсли; 		
	
КонецПроцедуры 

#КонецОбласти
